import React from 'react';

const paragraphs = [
  "لپ‌تاپ‌های گیمینگ همیشه جذابیت زیادی دارند؛ زیرا از یک طرف از طراحی پر زرق‌و‌برق بهره می‌برد و از سوی دیگر می‌توانند سنگین‌ترین برنامه‌ها و بازی‌ها را اجرا کنند. این نوع لپ‌تاپ‌ها طبیعتا قیمت بسیار بالایی دارند ولی در این ویدیو به بررسی لپ‌تاپ ایسوس TUF Gaming F15 می‌پردازیم که نسبت به امکاناتی که ارائه می‌دهد، قیمت منطقی دارد و در نتیجه در بازار خاورمیانه مورد توجه زیادی قرار گرفته است.",
  "همین ابتدا باید بگوییم که در این ویدیو به طور مشخص سراغ مدل FX506HC از این لپ‌تاپ رفته‌ایم که از نسل ۱۱ اینتل استفاده می‌کند. این لپ‌تاپ مجهز به پردازنده‌ی Core i5 11400H است و در کنار آن RTX 3050 به عنوان پردازنده گرافیکی انجام وظیفه می‌کند. در ضمن نباید بهره‌گیری از ۸ گیگابایت رم و ۵۱۲ گیگابایت حافظه SSD را از قلم بیندازیم.",
  "این لپ‌تاپ می‌تواند بازی God Of War را در تنظیمات متوسط و رزولوشن Full HD را با سرعت ۵۵ تا ۶۵ فریم در ثانیه اجرا کند. بازی سنگین و البته بسیار جذاب Red Dead 2 را می‌توانید با تنظیمات گرافیکی بالا و همین رزولوشن، با نرخ ۵۰ فریم در ثانیه تجربه کنید. اگر به بازی آنلاین Call Of Duty علاقه زیادی دارید، لپ‌تاپ ایسوس TUF Gaming F15 قادر است این بازی را با گرافیک بالا و نرخ حدود ۵۰ فریم در ثانیه اجرا کند.",
  "در نهایت برای اینکه لپ‌تاپ ایسوس TUF Gaming F15 را به چالش بکشیم، باید به سراغ بازی بسیار سنگین CyberPunk 2077 برویم. برای اجرای این بازی با تنظیمات گرافیکی متوسط، با نرخ ۴۰ تا ۵۰ فریم در ثانیه روبرو می‌شوید. یکی از مهم‌ترین ویژگی‌های پردازنده گرافیکی این لپ‌تاپ این است که از فناوری DLSS پشتیبانی می‌کند و اگر بازی موردنظر از این مشخصه بهره می‌برد، توصیه می‌کنیم آن را فعال کنید. زیرا با انجام این کار، در ازای افت ناچیز کیفیت تصویر، فریم‌ریت به طور قابل توجهی افزایش پیدا می‌کند.",
  "حدود دو سال از عرضه‌ی لپ‌تاپ FX506HC به بازار می‌گذرد. احتمالا بسیاری از افراد به شما توصیه می‌کنند سراغ لپ‌تاپی بروید که حداقل از پردازنده نسل ۱۲ یا نسل ۱۳ اینتل استفاده می‌کند. اما این لپ‌تاپ می‌تواند تمام بازی‌ها را به‌خوبی اجرا کند که البته اگر بازی موردنظر بسیار سنگین باشد، شاید باید به تنظیمات گرافیکی متوسط یا پایین راضی شوید. ولی در این محدوده‌ی قیمتی، بدون شک یکی از بهترین گزینه‌های موجود در بازار خاورمیانه محسوب می‌شود."
];

const Article: React.FC = () => {
  return (
    <div className="mt-7 text-sm">
      <a href="#" className="text-xl md:text-2xl text-zinc-700">
        معرفی نینتندو سوییچ 2
      </a>
      <div className="bg-red-400 w-6/12 h-px mt-5"></div>
      <div className="text-zinc-600 my-7 flex flex-wrap gap-y-5">
        {paragraphs.map((paragraph, index) => (
          <span key={index} className="leading-8 font-normal">
            {paragraph}
          </span>
        ))}
      </div>
    </div>
  );
};

export default Article;